app/controllers/mining_types_controller.rb

  def index
    @mining_types = MiningType.all
---
SELECT "mining_types".* FROM "mining_types"